"""
Вельмі просты вербалізатар - ён проста пераўтварае лічбы і лацінскія сімвалы ў словы.
Таксама пераўтвараюцца рускія 'и' і 'щ'.
"""


class NormalizationSimple:
    C2NAME = {
        '0': " нуль ", '1': " адзін ", '2': " два ", '3': " тры ", '4': " чытыры ",
        '5': " пяць ", '6': " шэсць ", '7': " сем ", '8': " восем ", '9': " дзевяць ",

        'A': " эй ", 'B': " бі ", 'C': " сі ", 'D': " дзі ", 'E': " і ", 'F': " эф ",
        'G': " джы ", 'H': " эйч ", 'I': " ай ", 'J': " джэй ", 'K': " кей ", 'L': " эл ",
        'M': " эм ", 'N': " эн ", 'O': " оў ", 'P': " пі ", 'Q': " кʼю ", 'R': " ар ",
        'S': " эс ", 'T': " ці ", 'U': " ю ", 'V': " ві ", 'W': " даблʼю ", 'X': " экс ",
        'Y': " уай ", 'Z': " зэд ",

        'a': " эй ", 'b': " бі ", 'c': " сі ", 'd': " дзі ", 'e': " і ", 'f': " эф ",
        'g': " джы ", 'h': " эйч ", 'i': " ай ", 'j': " джэй ", 'k': " кей ", 'l': " эл ",
        'm': " эм ", 'n': " эн ", 'o': " оў ", 'p': " пі ", 'q': " кʼю ", 'r': " ар ",
        's': " эс ", 't': " ці ", 'u': " ю ", 'v': " ві ", 'w': " даблʼю ", 'x': " экс ",
        'y': " уай ", 'z': " зэд ",

        'И': "і", 'и': "і",
        'Щ': "шч", 'щ': "шч"
    }

    def normalize(self, input_str: str) -> str:
        # Замяняем кожны сімвал, калі ён ёсць у слоўніку, інакш пакідаем як ёсць
        processed_chars = (self.C2NAME.get(char, char) for char in input_str)

        # Аб'ядноўваем сімвалы ў адзін радок
        result = "".join(processed_chars)

        return result
